loadtest/jmx/dm.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Newsfeed DM Load Test" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments">
        <collectionProp name="Arguments.arguments">
          <elementProp name="HOST" elementType="Argument">
            <stringProp name="Argument.name">HOST</stringProp>
            <stringProp name="Argument.value">${__P(HOST,app)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="PORT" elementType="Argument">
            <stringProp name="Argument.name">PORT</stringProp>
            <stringProp name="Argument.value">${__P(PORT,8080)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="THREADS" elementType="Argument">
            <stringProp name="Argument.name">THREADS</stringProp>
            <stringProp name="Argument.value">${__P(THREADS,300)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="DURATION" elementType="Argument">
            <stringProp name="Argument.name">DURATION</stringProp>
            <stringProp name="Argument.value">${__P(DURATION,60)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="RAMP" elementType="Argument">
            <stringProp name="Argument.name">RAMP</stringProp>
            <stringProp name="Argument.value">${__P(RAMP,15)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>

      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="DM 300u/60s" enabled="true">
        <stringProp name="ThreadGroup.num_threads">${THREADS}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${RAMP}</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">${DURATION}</stringProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="LC">
          <stringProp name="LoopController.loops">-1</stringProp>
          <boolProp name="LoopController.continue_forever">true</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>

        <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Defaults" enabled="true">
          <stringProp name="HTTPSampler.domain">${HOST}</stringProp>
          <stringProp name="HTTPSampler.port">${PORT}</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.connect_timeout">5000</stringProp>
          <stringProp name="HTTPSampler.response_timeout">15000</stringProp>
        </ConfigTestElement>
        <hashTree/>

        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HM Auth+JSON" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header"><stringProp name="Header.name">Content-Type</stringProp><stringProp name="Header.value">application/json</stringProp></elementProp>
            <elementProp name="" elementType="Header"><stringProp name="Header.name">Authorization</stringProp><stringProp name="Header.value">Bearer ${__P(TOKEN)}</stringProp></elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>

        <!-- 70% : POST /messages (send DM) -->
        <ThroughputController guiclass="ThroughputControllerGui" testclass="ThroughputController" testname="70% send" enabled="true">
          <intProp name="ThroughputController.style">1</intProp>
          <boolProp name="ThroughputController.perThread">false</boolProp>
          <intProp name="ThroughputController.maxThroughput">100</intProp>
          <FloatProperty><name>ThroughputController.percentThroughput</name><value>70.0</value><savedValue>0.0</savedValue></FloatProperty>
        </ThroughputController>
        <hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST /messages" enabled="true">
            <stringProp name="HTTPSampler.path">/messages</stringProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments">
                <elementProp name="" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.value">{"receiverId":${__P(RECEIVER_ID)},"content":"loadtest ${__threadNum} ${__time}"}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
          </HTTPSamplerProxy>
          <hashTree/>
        </hashTree>

        <!-- 30% : GET conversation -->
        <ThroughputController guiclass="ThroughputControllerGui" testclass="ThroughputController" testname="30% read" enabled="true">
          <intProp name="ThroughputController.style">1</intProp>
          <boolProp name="ThroughputController.perThread">false</boolProp>
          <intProp name="ThroughputController.maxThroughput">100</intProp>
          <FloatProperty><name>ThroughputController.percentThroughput</name><value>30.0</value><savedValue>0.0</savedValue></FloatProperty>
        </ThroughputController>
        <hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET conversation" enabled="true">
            <stringProp name="HTTPSampler.path">/messages/with/${__P(RECEIVER_ID)}?page=0&amp;size=20</stringProp>
            <stringProp name="HTTPSampler.method">GET</stringProp>
          </HTTPSamplerProxy>
          <hashTree/>
        </hashTree>

        <ResultCollector guiclass="SimpleDataWriter" testclass="ResultCollector" testname="results" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">/results/result.jtl</stringProp>
        </ResultCollector>
        <hashTree/>

        <BackendListener guiclass="BackendListenerGui" testclass="BackendListener" testname="InfluxDB" enabled="true">
          <stringProp name="classname">org.apache.jmeter.visualizers.backend.influxdb.InfluxdbBackendListenerClient</stringProp>
          <elementProp name="arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="influxdbMetricsSender" elementType="Argument"><stringProp name="Argument.name">influxdbMetricsSender</stringProp><stringProp name="Argument.value">org.apache.jmeter.visualizers.backend.influxdb.HttpMetricsSender</stringProp></elementProp>
              <elementProp name="influxdbUrl" elementType="Argument"><stringProp name="Argument.name">influxdbUrl</stringProp><stringProp name="Argument.value">http://influxdb:8086/write?db=jmeter</stringProp></elementProp>
              <elementProp name="application" elementType="Argument"><stringProp name="Argument.name">application</stringProp><stringProp name="Argument.value">newsfeed</stringProp></elementProp>
              <elementProp name="measurement" elementType="Argument"><stringProp name="Argument.name">measurement</stringProp><stringProp name="Argument.value">jmeter</stringProp></elementProp>
              <elementProp name="summaryOnly" elementType="Argument"><stringProp name="Argument.name">summaryOnly</stringProp><stringProp name="Argument.value">false</stringProp></elementProp>
              <elementProp name="samplersRegex" elementType="Argument"><stringProp name="Argument.name">samplersRegex</stringProp><stringProp name="Argument.value">.*</stringProp></elementProp>
              <elementProp name="percentiles" elementType="Argument"><stringProp name="Argument.name">percentiles</stringProp><stringProp name="Argument.value">50;90;95;99</stringProp></elementProp>
              <elementProp name="testTitle" elementType="Argument"><stringProp name="Argument.name">testTitle</stringProp><stringProp name="Argument.value">${__P(TEST_TITLE,DM Load Test)}</stringProp></elementProp>
              <elementProp name="eventTags" elementType="Argument"><stringProp name="Argument.name">eventTags</stringProp><stringProp name="Argument.value"></stringProp></elementProp>
            </collectionProp>
          </elementProp>
        </BackendListener>
        <hashTree/>

      </hashTree>

    </hashTree>
  </hashTree>
</jmeterTestPlan>